# Dialysis machines
This Notebook makes an exploratory analysis the datasets found under `./dataset`

## Data Gathering
Load the local parquet files inside a Pandas `DataFrame`.

### Machine 1

In [6]:
import pandas as pd

df_machine_1 = pd.read_parquet("dataset/machine_data_1.parquet")
print(
    f"The machine 1 data set has {len(df_machine_1)} records with {df_machine_1.shape[1]} variables."
)
df_machine_1.head()

The machine 1 data set has 3832 records with 7 variables.

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data
0,Machine_1,2023-06-01 09:46:28.611018,1,1.561568,None,0,0.747587
1,Machine_1,2023-06-02 09:46:28.611018,9,11.670001,None,0,0.725209
2,Machine_1,2023-06-03 09:46:28.611018,4,6.345075,High Temperature,1,0.773772
3,Machine_1,2023-06-04 09:46:28.611018,5,8.521391,None,0,0.728383
4,Machine_1,2023-06-05 09:46:28.611018,2,2.893482,None,0,0.780066

In [7]:
df_machine_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3832 entries, 0 to 2015
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          3832 non-null   object
 1   date                3832 non-null   datetime64[ns]
 2   num_treatments      3832 non-null   int64
 3   hours_of_operation  3832 non-null   float64
 4   alarms              212 non-null    object
 5   num_warnings        3832 non-null   int64
 6   sensor_data         3832 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 239.5+ KB

### Machine 2

In [8]:
df_machine_2 = pd.read_parquet("dataset/machine_data_2.parquet")
print(
    f"The machine 2 data set has {len(df_machine_2)} records with {df_machine_2.shape[1]} variables."
)
df_machine_2.head()

The machine 2 data set has 3832 records with 7 variables.

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data
0,Machine_1,2023-06-01 09:46:28.611018,10,16.739101,None,0,0.760686
1,Machine_1,2023-06-02 09:46:28.611018,9,15.811422,None,0,0.768058
2,Machine_1,2023-06-03 09:46:28.611018,9,17.964906,None,0,0.747932
3,Machine_1,2023-06-04 09:46:28.611018,9,17.250504,None,0,0.760337
4,Machine_1,2023-06-05 09:46:28.611018,7,8.173130,None,0,0.779009

In [9]:
df_machine_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3832 entries, 0 to 2271
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          3832 non-null   object
 1   date                3832 non-null   datetime64[ns]
 2   num_treatments      3832 non-null   int64
 3   hours_of_operation  3832 non-null   float64
 4   alarms              189 non-null    object
 5   num_warnings        3832 non-null   int64
 6   sensor_data         3832 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 239.5+ KB

### Machine details

In [10]:
df_machine_details = pd.read_parquet("dataset/machine_details.parquet")
print(
    f"The machine 2 data set has {len(df_machine_details)} records with {df_machine_details.shape[1]} variables."
)
df_machine_details.head()

The machine 2 data set has 10 records with 4 variables.

  machine_id     location    manufacturer    model
0  Machine_1     New York  Manufacturer_A  Model_X
1  Machine_2     New York  Manufacturer_C  Model_X
2  Machine_3  Los Angeles  Manufacturer_B  Model_Y
3  Machine_4  Los Angeles  Manufacturer_A  Model_Z
4  Machine_5      Phoenix  Manufacturer_C  Model_Y

In [11]:
df_machine_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   machine_id    10 non-null     object
 1   location      10 non-null     object
 2   manufacturer  10 non-null     object
 3   model         10 non-null     object
dtypes: object(4)
memory usage: 452.0+ bytes

### Maintainance Records

In [12]:
df_maintenance = pd.read_parquet("dataset/maintenance_records.parquet")
print(
    f"The machine 2 data set has {len(df_maintenance)} records with {df_maintenance.shape[1]} variables."
)
df_maintenance.head()

The machine 2 data set has 100 records with 4 variables.

   record_id machine_id                       date       description
0          1  Machine_4 2024-02-01 09:46:28.706811          Cleaning
1          2  Machine_4 2023-11-03 09:46:28.706820     Routine Check
2          3  Machine_5 2024-05-03 09:46:28.706824   Software Update
3          4  Machine_6 2023-11-29 09:46:28.706828          Cleaning
4          5  Machine_6 2023-09-21 09:46:28.706831  Part Replacement

In [13]:
df_maintenance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   record_id    100 non-null    int64
 1   machine_id   100 non-null    object
 2   date         100 non-null    datetime64[ns]
 3   description  100 non-null    object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 3.3+ KB

## Data merging